import React, { useState, useRef, useEffect } from "react";
import SectionTitle from "../../Shared/SectionTitle";
import { Helmet } from "react-helmet";
import { useLocation } from "react-router-dom";

const FAQ = () => {
  const [activeIndex, setActiveIndex] = useState(null);
  const contentRef = useRef(null);

  const handleClick = (index) => {
    setActiveIndex(index === activeIndex ? null : index);
  };

  useEffect(() => {
    if (contentRef.current && activeIndex === 0) {
      contentRef.current.focus();
    }
  }, [contentRef, activeIndex]);

  const activePathname = useLocation().pathname;

  if (activePathname === "/faq") {
    console.log("faq");
  }

  return (
    <div className="max-w-[1280px] w-full mx-auto mt-24 tablet:mt-32 px-4 tablet:px-0">
      {activePathname === "/faq" && (
        <Helmet>
          <title>
            FAQ @ ShohozAin - Frequently Asked Questions About Our Legal
            Services
          </title>
          <meta
            name="description"
            content="Find answers to common questions about ShohozAin's legal services. Learn more about our platform, how to get started, pricing, and how we can assist with your legal needs. Get all the information you need in our FAQ section."
          />
          <meta
            name="keywords"
            content="ShohozAin FAQ, legal services questions, ShohozAin help, legal assistance FAQ, getting started with ShohozAin, legal service pricing, common legal questions"
          />
        </Helmet>
      )}

      <div className="">
        <SectionTitle
          title={"সাধারন জিজ্ঞাসা"}
          subTitle={"সচরাচর যেসব প্রশ্ন যেসব প্রশ্ন আপনারা জিজ্ঞেস করেন"}
        ></SectionTitle>
        <div className="mx-auto mt-10">
          <div className="border-b border-gray-200">
            {faqs.map((faq, index) => (
              <div
                key={faq.question}
                className={`border-t border-gray-200 ${
                  activeIndex === index ? "" : ""
                }`}
              >
                <div
                  className="flex justify-between items-center cursor-pointer p-4"
                  onClick={() => handleClick(index)}
                  onKeyDown={(event) => {
                    if (event.key === "Enter") {
                      handleClick(index);
                    }
                  }}
                  tabIndex={activeIndex === index ? "0" : "-1"}
                  aria-expanded={activeIndex === index}
                >
                  <h3 className="text-base tablet:text-xl text-orange-500 font-bold">
                    {faq.question}
                  </h3>
                  <span className="text-bold text-orange-500 text-base tablet:text-xl">
                    {activeIndex === index ? "-" : "+"}
                  </span>
                </div>
                {activeIndex === index && (
                  <div
                    className="px-4 pb-2"
                    ref={contentRef}
                    tabIndex={activeIndex === index ? "0" : "-1"}
                    aria-labelledby={`question-${index}`}
                  >
                    <p className="font-semibold text-base tablet:text-xl cursor-default">
                      {faq.answer}
                    </p>
                  </div>
                )}
              </div>
            ))}
          </div>
        </div>
      </div>
    </div>
  );
};

export const faqs = [
  {
    question: "জমির ই-নামজারি করার নিয়ম ?",
    answer:
      "জমির ই-নামজারি করতে ভূমি মন্ত্রণালয়ের ওয়েবসাইটে গিয়ে নির্দিষ্ট প্রক্রিয়া অনুসরণ করে আবেদন করতে হবে। আবেদনের সঙ্গে জমির মালিকের জাতীয় পরিচয়পত্র, ছবি, মোবাইল নম্বরসহ জমির বিস্তারিত পরিচয় যেমন জমির খতিয়ান নম্বর, দাগ নম্বর, জমির পরিমাণ, মৌজা, জেলা উল্লেখ করতে হবে এবং দলিলের ও সকল ডকুমেন্টের স্ক্যান কপি আপলোড করতে হবে। পরবর্তী সময় সমস্ত দলিলের এক সেট সহকারী কমিশনার (ভূমি) অফিসে জমা দিতে হবে। অনলাইনেই নামজারির আবেদন ফি জমা দিতে হবে। নামজারি আবেদনটি কোন স্তরে আছে, তা ভূমি মন্ত্রণালয়ের ওয়েবসাইট থেকেই যাচাই করতে পারবেন এবং মোবাইলে মেসেজের মাধ্যমে আবেদনকারীকে আবেদনের সকল তথ্য ও পরবর্তী পদক্ষেপ জানিয়ে দেওয়া হবে। মেসেজের  নির্দেশনা অনুযায়ি পরবর্তী পদক্ষেপ নিলে নির্দিষ্ট সময় পরে সকল কাগজপত্র ঠিক থাকলে আপনার জমির নামজারির আবেদন মঞ্জুর হয়ে জাবে। জমির নামজারির আবেদন মঞ্জুর হলে ডিসিআর ফি অনলাইনে জমা দিয়ে অনলাইন থেকে খতিয়ান ডাউনলোড করে নিতে হবে।",
  },

  {
    question: "দলিলের ভুল সংশোধন করার নিয়ম ?",
    answer:
      "জমির দলিলের ভুল আপনারা দুইটি উপায়ে সংশোধন করতে পারবেন। প্রথম উপায়- সাব-রেজিস্ট্রার কর্তৃক সংশোধন: দলিল রেজিস্ট্রির পর তাতে দাগ, খতিয়ান বা নামের ছোট-খাটো কোন ভুল ধরা পড়লে এবং যে ভুল সংশোধন করলে দলিলের মূল কাঠামো বা স্বত্বেও কোন পরিবর্তন ঘটবে না সেরূপ ভুল সংশোধনের জন্য সংশ্লিষ্ট সাব-রেজিস্ট্রার বরাবরে আবেদন করতে পারবেন । সাব-রেজিস্ট্রার এই ধরনের ছোট-খাটো ভুল সংশোধন করতে পারেন। সাব-রেজিস্ট্রারের কার্যালয়ে সম্ভব না হলে, আদালতে মামলা দায়ের করে আদালতের রায়  ডিক্রী নিয়ে দলিলের ভুল সংশোধন করতে হবে। দ্বিতীয় উপায়- আদালতের মাধ্যমে- দলিল রেজিস্ট্রির পর তাতে দাগ, খতিয়ান, মৌজা, চৌহদ্দি বা নামের বড় ধরনের কোন ভুল ৩ বছরের মধ্যে ধরা পড়লে তা খুব সহজেই সংশোধন করা যায়। এরূপ ভুল হওয়ার ৩ বছরের মধ্যে দেওয়ানি আদালতে দলিল সংশোধনের মামলা করতে হবে। ৩ বছর পর এরূপ মামলা তামাদির দ্বারা বারিত হয়ে যায়। তাই তখন আর সংশোধন মামলা করা যায় না, তবে ঘোষণামূলক মামলা করা যায়। এরূপ মামলার রায়ই হল সংশোধন দলিল। রায়ের ১ কপি আদালত হতে সংশ্লিষ্ট সাব-রেজিস্ট্রার এর নিকট পাঠানো হলে সাব-রেজিস্ট্রার উক্ত রায়ের আলোকে সংশ্লিষ্ট ভলিউম সংশোধন করে নিবেন, ফলে নতুন করে কোন দলিল করার আর কোন প্রয়োজন নেই (সুনির্দিষ্ট প্রতিকার আইন ৩১ ধারা৷)",
  },

  {
    question: "দলিল বাতিল করার নিয়ম ?",
    answer: "কয়েক প্রকারের দলিল আছে, যেগুলো সম্পত্তি হস্তান্তরের দলিল নয়, যেমন- বায়নাপত্র দলিল, পাওয়ার অব অ্যাটর্নি (আমমোক্তারনামা) দলিল, উইল দলিল, অছিয়ত দলিল, চুক্তিপত্র দলিল ইত্যাদি  রেজিস্ট্রি অফিসে বাতিলকরণ দলিল রেজিস্ট্রির মাধ্যমে সংশ্লিষ্ট দলিলের পক্ষগণ সকলের সম্মতিতে একত্রে দলিল সম্পাদনের মাধ্যমে বাতিল করতে পারেন। সম্পত্তি হস্তান্তরের বিভিন্ন দলিল যেমন, সাফ কবলা, দানপত্র, হেবার ঘোষণাপত্র, হেবাবিল এওয়াজ ইত্যাদি দলিল রেজিস্ট্রি অফিসে বাতিলকরণ দলিল রেজিস্ট্রি করে বাতিল করা যায় না। আইনগত ও যৌক্তিক কারণে বাতিলের প্রয়োজন হলে আদালতে মোকদ্দমা দায়ের করে বাতিলের করতে হয়। এমনিভাবে রেজিস্ট্রিকৃত জাল দলিল বাতিলের ক্ষমতা সাব-রেজিস্ট্রার এর নেই। জাল দলিল বাতিলের ক্ষমতা আদালতের উপর ন্যস্ত করা হয়েছে। তাই দলিল জাল হলে জাল দলিলটি বাতিলের জন্য আদালতে মোকদ্দমা দায়ের করতে হবে। সুনির্দিষ্ট প্রতিকার আইন, ১৮৭৭ এর ৩৯ ধারায় রেজিস্ট্রিকৃত দলিল বাতিলের পদ্ধতি লেখা রয়েছে। এ ধারা মোতাবেক, যে কোন ব্যক্তি যার বিরুদ্ধে লিখিত চুক্তি বাতিল কিংবা বাতিলযোগ্য, যার যুক্তিসঙ্গত সম্ভাবনা আছে যে, সেরূপ দলিল যদি অনিস্পন্ন অবস্থায় ছেড়ে দেয়া হয়, তবে তার গুরুতর ক্ষতির কারন হবে; তবে সে দলিলটি বাতিল বা বাতিলযোগ্য ঘোষনার জন্য মোকাদ্দমা দায়ের করতে পারে এবং আদালত তার স্বেচ্ছাধীন ক্ষমতা বলে উক্ত রূপে রায় প্রদান করতে পারেন ও চুক্তিটি বাতিল করার নির্দেশ দিতে পারেন। তবে যদি কোন দলিল রেজিস্ট্রেশন আইন, ১৯০৮ অনুসারে রেজিস্ট্রিকৃত হয়ে থাকে (অর্থাৎ বালাম বহিতে নকল বা কপি হয়ে থাকে), তবে আদালত এরূপ ডিক্রীর একটি কপি সংশ্লিষ্ট রেজিস্ট্রি অফিসে প্রেরন করবেন। আদালতের আদেশ প্রাপ্তির পর সংশ্লিষ্ট কর্মকর্তা, দলিলটি রেজিস্টার বইয়ের যে পৃষ্টায় নকল হয়েছে সেখানে বিলুপ্তির বিষয়ে টীকা লিপিবদ্ধ করবেন। কোন রেজিস্ট্রিকৃত দলিল আদালতে জাল বা কপট পরিচয় প্রদানকারী ব্যক্তির মাধ্যমে রেজিস্ট্রিকৃত হয়েছে মর্মে ঘোষিত হলে, সংশ্লিষ্ট আদালত হতে ডিক্রির নকল প্রাপ্তির পর রেজিস্ট্রি অফিসে সংশ্লিষ্ট রেজিস্টার বহিতে নকলের মার্জিনে এবং প্রাপ্তি সাপেক্ষে দলিলটিতেও উক্ত বিষয়ে একটি টীকা লিপিবদ্ধ করতে হবে।",
  },

  {
    question: "খতিয়ানের ভুল সংশোধন করার নিয়ম ?",
    answer:
      "ভুল সংশোধনের জন্য সংশ্লিষ্ট উপজেলা সার্ভে অফিসে আবেদন করুন এবং আবেদনের সাথে প্রয়োজনীয় কাগজপত্র (আবেদনপত্র, খতিয়ানের স্ক্যান কপি, ভুলের প্রমাণ, ন্যাশনাল আইডি কার্ডের স্ক্যান কপি, পাসপোর্ট সাইজের ছবি, ফি) জমা দিতে হবে।",
  },

  {
    question: "খতিয়ানের করণিক ভুল সংশোধন করার নিয়ম ?",
    answer:
      "করণিক ভুলের মধ্যে নামের ভুল, অংশ বসানোর হিসেবে ভুল, দাগসুচিতে ভুল, ম্যাপের সংঙ্গে রেকর্ডের ভুল, জরিপকালে বাবার মৃত্যুর কারণে সন্তানদের নামে সম্পত্তি রেকর্ড হবার কথা থাকলেও জরিপকারকদের ভুল বা অজ্ঞাত কারণে তা মূল প্রজা বা বাবার নামে রেকর্ড হওয়া ইত্যাদি উল্লেখযোগ্য। খতিয়ানের করণীক ভুল সংশোধনের জন্য আপনাকে সংশ্লিষ্ট সহকারী কমিশনার (ভূমি) এর বরাবর আতবদন করতে হবে। সহকারী কমিশনার (ভূমি) আবেদন প্রাপ্তির পর সংশ্লিষ্ট রেজিস্টারে এন্ট্রি দিয়ে ইউনিয়ন ভূমি অফিসে প্রেরণ করা হয়। ইউনিয়ন ভূমি সহকারী কর্মকর্তা সরজমিন তদন্ত ও রেকর্ডপত্র যাচাই অন্তে প্রস্তাব/প্রতিবেদন উপজেলা ভূমি অফিসে প্রেরণ করেন। উক্ত প্রতিবেদন প্রাপ্তির পর বা আবেদন প্রাপ্তির পরই ইউনিয়ন ভূমি সহকারী কর্মকর্তার প্রতিবেদন দাখিলের সময়সীমা নির্ধারণ করার পাশাপাশি সহকারী কমিশনার (ভূমি) শুনানির তারিখ/দিন ধার্য করে আবেদনকারী/রেকর্ডীয় মালিক এবং স্বার্থসংশ্লিষ্টদের নোটিশ প্রদান করেন। ধার্য তারিখে শুনানি ও কাগজপত্র পরীক্ষা-নিরীক্ষা করে খতিয়ানের করণিক ভুল সংশোধনের আদেশ দেওয়া হয়। আদেশ অনুসারে ইউনিয়ন ভূমি সহকারী কর্মকর্তা কর্তৃক প্রস্তুতকৃত সংশোধিত ০৫ (পাঁচ) কপি খতিয়ানে স্বাক্ষর অন্তে প্রয়োজনীয় ফি আদায় সাপেক্ষে আবেদনকারীকে ১ (এক) কপি, মূল নথিতে ১ (এক), মূল খতিয়ান ভলিউমের সঙ্গে ১ (এক) কপি, জেলা রেকর্ড রুমে ১ (এক) কপি এবং ইউনিয়ন ভূমি অফিসের মূল ভলিউমে ১ (এক) কপি সংরক্ষণের জন্য প্রেরণ করা হয়। ইউনিয়ন ভূমি সহকারী কর্মকর্তা রেজিস্টার-২ হালনাগাদ করে প্রতিবেদন দাখিল করার মাধ্যমে খতিয়ানের করণিক ভুল সংশোধন প্রক্রিয়া সম্পন্ন হয়।",
  },

  {
    question: "দেওয়ানী মামলার শেষ করতে কতদিন লাগে ?",
    answer:
      "মামলার ধরণ, জটিলতা, এবং আদালতের কার্যপ্রণালীর উপর নির্ভর করে দেওয়ানী মামলার শেষ করতে কতদিন লাগবে তা নির্ধারণ করা কঠিন। সাধারণত, একটি দেওয়ানী মামলা শেষ করতে কয়েক বছর সময় লাগতে পারে।",
  },

  {
    question: "নামজারি করার খরচ কত ?",
    answer:
      "নামজারির খরচ নির্ভর করে জমির পরিমাণ, মূল্য এবং নামজারির ধরনে। খরচের মোটামুটি ধারণা: আবেদন ফি: ৫০ টাকা, মাপ ফি: প্রতি শতক জমির জন্য ১০ টাকা, নামজারি ফি: জমির মূল্যের ০.৫%, ডাক টিকিট: ৫০ টাকা, অন্যান্য খরচ: (প্রযোজ্য হলে)",
  },

  {
    question: "নামজারি বাতিল করার নিয়ম কি ?",
    answer:
      "নামজারি বাতিলের জন্য আপনাকে নিম্নলিখিত পদক্ষেপগুলি অনুসরণ করতে হবে: আবেদনপত্র: সংশ্লিষ্ট উপজেলা সার্ভে অফিসে একটি আবেদনপত্র জমা দিতে হবে। কারণ উল্লেখ: আবেদনপত্রে নামজারি বাতিল করার কারণ স্পষ্টভাবে উল্লেখ করতে হবে। প্রয়োজনীয় কাগজপত্র: আবেদনপত্রের সাথে প্রয়োজনীয় কাগজপত্র (মূল দলিল, নামজারি সনদ, ইত্যাদি) জমা দিতে হবে। বিচার-বিবেচনা: উপজেলা সার্ভে অফিসার আপনার আবেদন বিবেচনা করে নামজারি বাতিলের সিদ্ধান্ত নেবেন।",
  },

  {
    question: "বন্টন মামলা কিভাবে করতে হয় ?",
    answer:
      "বন্টন মামলা করার জন্য আপনাকে নিম্নলিখিত পদক্ষেপগুলি অনুসরণ করতে হবে: আবেদনপত্র: সংশ্লিষ্ট পারিবারিক আদালতে একটি আবেদনপত্র জমা দিতে হবে। মামলার বিবরণ: আবেদনপত্রে সম্পত্তির বিবরণ, ভাগ্যের হিস্যা, এবং মামলার কারণ স্পষ্টভাবে উল্লেখ করতে হবে। প্রয়োজনীয় কাগজপত্র: আবেদনপত্রেআবেদনপত্রের সাথে প্রয়োজনীয় কাগজপত্র (মূল দলিল, ওয়ারিশ সনদ, ইত্যাদি) জমা দিতে হবে। মামলার বিচার: আদালত আপনার মামলার বিচার করে সম্পত্তির বন্টনের রায় দেবেন।",
  },
  {
    question: "ওয়ারিশ সম্পত্তি না পেলে করণীয় কি ?",
    answer:
      "ওয়ারিশ সম্পত্তি না পেলে আপনি নিম্নলিখিত পদক্ষেপগুলি গ্রহণ করতে পারেন: আলোচনা: প্রথমে ওয়ারিশদের সাথে আলোচনার মাধ্যমে সমস্যা সমাধানের চেষ্টা করুন। ওয়ারিশ সনদ: আপনার ওয়ারিশ হিসেবে স্বীকৃতির জন্য ওয়ারিশ সনদ তৈরি করুন। আইনি পদক্ষেপ: আলোচনায় সমাধান না হলে, পারিবারিক আদালতে মামলা দায়ের করুন।",
  },
];

export default FAQ;
