export const servicesData = [
  {
    title: "জমি সংক্রান্ত",
    image: "jomi-joma@shohozAin.png",
    subservices: [
      "জমি ক্রয়-বিক্রয়",
      "জমি দলিল",
      "জমি বন্টন",
      "ভাগচাড়া",
      "মালিকানা",
      "লিজ",
      "দখল",
      "বিরোধ নিষ্পত্তি",
      "মামলা",
    ],
  },
  {
    title: "মামলা",
    image: "mamla@shohozAin.png",
    subservices: [
      "ফৌজদারি মামলা",
      "দেওয়ানি মামলা",
      "পারিবারিক মামলা",
      "বিবাহ বিচ্ছেদ",
      "ভরণপোষণ",
      "সম্পত্তির বন্টন",
      "জমি সংক্রান্ত মামলা",
      "চুক্তি ভঙ্গের মামলা",
    ],
  },
  {
    title: "চুক্তি",
    image: "chukti@shohozAin.png",
    subservices: [
      "চুক্তি পর্যালোচনা",
      "চুক্তি প্রণয়ন",
      "চুক্তি বাস্তবায়ন",
      "চুক্তি ভঙ্গের মামলা",
    ],
  },
  {
    title: "পরামর্শ",
    image: "poramorso@shohozAin.png",
    subservices: [
      "আইনি পরামর্শ",
      "ব্যবসায়িক পরামর্শ",
      "পারিবারিক পরামর্শ",
      "কর পরামর্শ",
    ],
  },
  {
    title: "অন্যান্য",
    image: "onnano@shohozAin.png",
    subservices: ["নোটারি", "স্ট্যাম্প", "আইনি নথি প্রণয়ন", "আইনি অনুবাদ"],
  },
];
