export const servicesData = [
  {
    title: "জমি সংক্রান্ত",
    image: "jomi-joma@shohozAin.png",
    subservices: [
      "মালিকানার কাগজ দেখা",
      "ভূমি সংক্রান্ত কাগজ ‍উত্তোলন",
      "জমি ফারায়েজ করা",
      "জমি বন্টন করা",
      "জমি বাটোয়ারা করা",
      "মালিকানার কাগজপত্র তল্লাসি",
      "দলিল, খতিয়ানের সার্টিফাইট কপি",
      "মৌজা ম্যাপ সংগ্রহ",
      "মালিকানার কাগজ যাচাই করা",
      "জমি খারিজ করা / নামজারি করা",

    ],
  },
  {
    title: "মামলা / মোকাদ্দমা",
    image: "mamla@shohozAin.png",
    subservices: [
      "দেওয়ানি মোকাদ্দমা",
      "ফৌজদারি মামলা",
      "জমি জমা সংক্রান্ত মোকাদ্দমা",
      "পারিবারিক মোকাদ্দমা",
      "অর্থ ধন মোকাদ্দমা",
      "চেকের মামলা",
      "চুক্তি ভঙ্গের মামলা",
      "বাড়িভাড়া সংক্রান্ত মোকাদ্দমা",
      "বিবিধ মোকাদ্দমা",

      ,
    ],
  },
  {
    title: "চুক্তি",
    image: "chukti@shohozAin.png",
    subservices: [
      "চুক্তি পর্যালোচনা",
      "চুক্তি প্রণয়ন",
      "চুক্তি বাস্তবায়ন",
      "চুক্তি ভঙ্গের মামলা",
    ],
  },
  {
    title: "পরামর্শ",
    image: "poramorso@shohozAin.png",
    subservices: [
      "আইনি পরামর্শ",
      "দেওয়ানি পরামর্শ",
      "ফৌজদারি পরামর্শ",
      "ব্যবসায়িক আইন পরামর্শ",
      "পারিবারিক পরামর্শ",
      "কর পরামর্শ",
    ],
  },
  {
    title: "অন্যান্য",
    image: "onnano@shohozAin.png",
    subservices: ["নোটারি", "স্ট্যাম্প", "আইনি নথি প্রণয়ন", "আইনি অনুবাদ"],
  },
];
