export const servicesData = [
  {
    title: "জমি সংক্রান্ত",
    image: "jomi-joma@shohozAin.png",
    subservices: [
      "মালিকানার কাগজপত্র দেখা",
      "মালিকানার কাগজপত্র তল্লাসি",
      "জমির অবস্থান নিশ্চিত করা",
      "মালিকানার কাগজপত্র ‍উত্তোলন",
      "জমি ফারায়েজ করা",
      // "",
      "জমি বাটোয়ারা করা",
      "দলিল, খতিয়ানের ও ম্যাপ ‍উত্তোলন",
      // "মৌজা ম্যাপ সংগ্রহ",
      "মালিকানার কাগজ যাচাই করা",
      "জমি খারিজ / নামজারি করা",

    ],
  },
  {
    title: "মামলা / মোকাদ্দমা",
    image: "mamla@shohozAin.png",
    subservices: [
      "দেওয়ানী মোকাদ্দমা",
      "অর্থ ঋণ মোকাদ্দমা",
      "পারিবারিক মোকাদ্দমা",
      "আরবিট্রেশন মোকাদ্দমা",
      "চুক্তি প্রবল মোকদ্দমা",
      "বাড়িভাড়া মোকাদ্দমা",
      "ফৌজদারী মামলা",
      // "জমি জমা সংক্রান্ত মোকাদ্দমা",
      "চেক সংক্রান্ত মামলা",
      "বিবিধ মোকাদ্দমা",

      ,
    ],
  },
  {
    title: "চুক্তি",
    image: "chukti@shohozAin.png",
    subservices: [
      "চুক্তি প্রস্তুত করা",
      "চুক্তি পর্যালোচনা",
      // "চুক্তি বাস্তবায়ন",
      "চুক্তি ভঙ্গের মোকাদ্দমা",
    ],
  },
  {
    title: "পরামর্শ",
    image: "poramorso@shohozAin.png",
    subservices: [
      "জমি জমা সংক্রান্ত",
      "ব্যাংক ঋণ সংক্রান্ত",
      "দেওয়ানী মোকদ্দমা সংক্রান্ত",
      "পারিবারিক সমস্যা ও মোকদ্দমা সংক্রান্ত",
      "অর্থ ঋণ মোকদ্দমা সংক্রান্ত",
      "চুক্তি সংক্রান্ত",
      "চেকের মামলা সংক্রান্ত",

      "ফৌজদারী মামলা সংক্রান্ত",
      // "ব্যবসায়িক আইন পরামর্শ",
      // "কর পরামর্শ",
    ],
  },
  {
    title: "অন্যান্য",
    image: "onnano@shohozAin.png",
    subservices: ["নোটারি করা", , "মামলা মোকাদ্দমার কাগজপত্র উত্তোলন", "অনুবাদ"],
  },
];
