export const COURSESTAGES = [
  {
    title: "মামলা গ্রহণ",
    description:
      "মামলা গ্রহণের প্রক্রিয়া সম্পর্কে জানুন, যেখানে মামলা দাখিল, অভিযোগ নির্ধারণ এবং আদালতে মামলা প্রক্রিয়ার প্রাথমিক ধাপগুলো আলোচনা করা হয়।",
  },
  {
    title: "জমি জমা",
    description:
      "জমি ও সম্পত্তি সম্পর্কিত আইনি বিষয়গুলো, যেমন জমির মালিকানা, নিবন্ধন প্রক্রিয়া, জমি সংক্রান্ত বিরোধের নিষ্পত্তি এবং আদালতের সিদ্ধান্ত বাস্তবায়ন নিয়ে বিশদ আলোচনা করুন।",
  },
  {
    title: "ফৌজদারি মামলা",
    description:
      "ফৌজদারি মামলার প্রক্রিয়া, অপরাধমূলক কার্যকলাপ, অভিযুক্তের অধিকার এবং ফৌজদারি বিচারপদ্ধতি সম্পর্কে বিস্তারিত জানুন।",
  },
  {
    title: "পারিবারিক আইন",
    description:
      "পারিবারিক আইনের অধীনে বিবাহ, তালাক, উত্তরাধিকার এবং পরিবারের সম্পত্তি সংক্রান্ত বিষয়গুলোর আইনি দিকগুলি সম্পর্কে জানুন।",
  },
  {
    title: "চুক্তি আইন",
    description:
      "চুক্তি প্রণয়ন, বৈধতা, চুক্তি ভঙ্গের প্রভাব এবং এর সাথে সম্পর্কিত আইনগুলোর বিশদ আলোচনা।",
  },
  {
    title: "আইনি নথি প্রণয়ন",
    description:
      "আইনি নথি যেমন চুক্তি, প্রাপ্তির কাগজপত্র, এবং অন্যান্য আইনি ডকুমেন্ট প্রস্তুতির কৌশল এবং প্রয়োজনীয়তা সম্পর্কে জানুন।",
  },
];
