export const FaqData = [
    {
      question: "জমির ই-নামজারি করার নিয়ম ?",
      answer:
        "জমির ই-নামজারি করতে ভূমি মন্ত্রণালয়ের ওয়েবসাইটে গিয়ে নির্দিষ্ট প্রক্রিয়া অনুসরণ করে আবেদন করতে হবে। আবেদনের সঙ্গে জমির মালিকের জাতীয় পরিচয়পত্র, ছবি, মোবাইল নম্বরসহ জমির বিস্তারিত পরিচয় যেমন জমির খতিয়ান নম্বর, দাগ নম্বর, জমির পরিমাণ, মৌজা, জেলা উল্লেখ করতে হবে এবং দলিলের ও সকল ডকুমেন্টের স্ক্যান কপি আপলোড করতে হবে। পরবর্তী সময় সমস্ত দলিলের এক সেট সহকারী কমিশনার (ভূমি) অফিসে জমা দিতে হবে। অনলাইনেই নামজারির আবেদন ফি জমা দিতে হবে। নামজারি আবেদনটি কোন স্তরে আছে, তা ভূমি মন্ত্রণালয়ের ওয়েবসাইট থেকেই যাচাই করতে পারবেন এবং মোবাইলে মেসেজের মাধ্যমে আবেদনকারীকে আবেদনের সকল তথ্য ও পরবর্তী পদক্ষেপ জানিয়ে দেওয়া হবে। মেসেজের  নির্দেশনা অনুযায়ি পরবর্তী পদক্ষেপ নিলে নির্দিষ্ট সময় পরে সকল কাগজপত্র ঠিক থাকলে আপনার জমির নামজারির আবেদন মঞ্জুর হয়ে জাবে। জমির নামজারির আবেদন মঞ্জুর হলে ডিসিআর ফি অনলাইনে জমা দিয়ে অনলাইন থেকে খতিয়ান ডাউনলোড করে নিতে হবে।",
    },
  
    {
      question: "দলিলের ভুল সংশোধন করার নিয়ম ?",
      answer:
        "জমির দলিলের ভুল আপনারা দুইটি উপায়ে সংশোধন করতে পারবেন। প্রথম উপায়- সাব-রেজিস্ট্রার কর্তৃক সংশোধন: দলিল রেজিস্ট্রির পর তাতে দাগ, খতিয়ান বা নামের ছোট-খাটো কোন ভুল ধরা পড়লে এবং যে ভুল সংশোধন করলে দলিলের মূল কাঠামো বা স্বত্বেও কোন পরিবর্তন ঘটবে না সেরূপ ভুল সংশোধনের জন্য সংশ্লিষ্ট সাব-রেজিস্ট্রার বরাবরে আবেদন করতে পারবেন । সাব-রেজিস্ট্রার এই ধরনের ছোট-খাটো ভুল সংশোধন করতে পারেন। সাব-রেজিস্ট্রারের কার্যালয়ে সম্ভব না হলে, আদালতে মামলা দায়ের করে আদালতের রায়  ডিক্রী নিয়ে দলিলের ভুল সংশোধন করতে হবে। দ্বিতীয় উপায়- আদালতের মাধ্যমে- দলিল রেজিস্ট্রির পর তাতে দাগ, খতিয়ান, মৌজা, চৌহদ্দি বা নামের বড় ধরনের কোন ভুল ৩ বছরের মধ্যে ধরা পড়লে তা খুব সহজেই সংশোধন করা যায়। এরূপ ভুল হওয়ার ৩ বছরের মধ্যে দেওয়ানি আদালতে দলিল সংশোধনের মামলা করতে হবে। ৩ বছর পর এরূপ মামলা তামাদির দ্বারা বারিত হয়ে যায়। তাই তখন আর সংশোধন মামলা করা যায় না, তবে ঘোষণামূলক মামলা করা যায়। এরূপ মামলার রায়ই হল সংশোধন দলিল। রায়ের ১ কপি আদালত হতে সংশ্লিষ্ট সাব-রেজিস্ট্রার এর নিকট পাঠানো হলে সাব-রেজিস্ট্রার উক্ত রায়ের আলোকে সংশ্লিষ্ট ভলিউম সংশোধন করে নিবেন, ফলে নতুন করে কোন দলিল করার আর কোন প্রয়োজন নেই (সুনির্দিষ্ট প্রতিকার আইন ৩১ ধারা৷)",
    },
  
    {
      question: "দলিল বাতিল করার নিয়ম ?",
      answer: "কয়েক প্রকারের দলিল আছে, যেগুলো সম্পত্তি হস্তান্তরের দলিল নয়, যেমন- বায়নাপত্র দলিল, পাওয়ার অব অ্যাটর্নি (আমমোক্তারনামা) দলিল, উইল দলিল, অছিয়ত দলিল, চুক্তিপত্র দলিল ইত্যাদি  রেজিস্ট্রি অফিসে বাতিলকরণ দলিল রেজিস্ট্রির মাধ্যমে সংশ্লিষ্ট দলিলের পক্ষগণ সকলের সম্মতিতে একত্রে দলিল সম্পাদনের মাধ্যমে বাতিল করতে পারেন। সম্পত্তি হস্তান্তরের বিভিন্ন দলিল যেমন, সাফ কবলা, দানপত্র, হেবার ঘোষণাপত্র, হেবাবিল এওয়াজ ইত্যাদি দলিল রেজিস্ট্রি অফিসে বাতিলকরণ দলিল রেজিস্ট্রি করে বাতিল করা যায় না। আইনগত ও যৌক্তিক কারণে বাতিলের প্রয়োজন হলে আদালতে মোকদ্দমা দায়ের করে বাতিলের করতে হয়। এমনিভাবে রেজিস্ট্রিকৃত জাল দলিল বাতিলের ক্ষমতা সাব-রেজিস্ট্রার এর নেই। জাল দলিল বাতিলের ক্ষমতা আদালতের উপর ন্যস্ত করা হয়েছে। তাই দলিল জাল হলে জাল দলিলটি বাতিলের জন্য আদালতে মোকদ্দমা দায়ের করতে হবে। সুনির্দিষ্ট প্রতিকার আইন, ১৮৭৭ এর ৩৯ ধারায় রেজিস্ট্রিকৃত দলিল বাতিলের পদ্ধতি লেখা রয়েছে। এ ধারা মোতাবেক, যে কোন ব্যক্তি যার বিরুদ্ধে লিখিত চুক্তি বাতিল কিংবা বাতিলযোগ্য, যার যুক্তিসঙ্গত সম্ভাবনা আছে যে, সেরূপ দলিল যদি অনিস্পন্ন অবস্থায় ছেড়ে দেয়া হয়, তবে তার গুরুতর ক্ষতির কারন হবে; তবে সে দলিলটি বাতিল বা বাতিলযোগ্য ঘোষনার জন্য মোকাদ্দমা দায়ের করতে পারে এবং আদালত তার স্বেচ্ছাধীন ক্ষমতা বলে উক্ত রূপে রায় প্রদান করতে পারেন ও চুক্তিটি বাতিল করার নির্দেশ দিতে পারেন। তবে যদি কোন দলিল রেজিস্ট্রেশন আইন, ১৯০৮ অনুসারে রেজিস্ট্রিকৃত হয়ে থাকে (অর্থাৎ বালাম বহিতে নকল বা কপি হয়ে থাকে), তবে আদালত এরূপ ডিক্রীর একটি কপি সংশ্লিষ্ট রেজিস্ট্রি অফিসে প্রেরন করবেন। আদালতের আদেশ প্রাপ্তির পর সংশ্লিষ্ট কর্মকর্তা, দলিলটি রেজিস্টার বইয়ের যে পৃষ্টায় নকল হয়েছে সেখানে বিলুপ্তির বিষয়ে টীকা লিপিবদ্ধ করবেন। কোন রেজিস্ট্রিকৃত দলিল আদালতে জাল বা কপট পরিচয় প্রদানকারী ব্যক্তির মাধ্যমে রেজিস্ট্রিকৃত হয়েছে মর্মে ঘোষিত হলে, সংশ্লিষ্ট আদালত হতে ডিক্রির নকল প্রাপ্তির পর রেজিস্ট্রি অফিসে সংশ্লিষ্ট রেজিস্টার বহিতে নকলের মার্জিনে এবং প্রাপ্তি সাপেক্ষে দলিলটিতেও উক্ত বিষয়ে একটি টীকা লিপিবদ্ধ করতে হবে।",
    },
  
    {
      question: "খতিয়ানের ভুল সংশোধন করার নিয়ম ?",
      answer:
        " খতিয়ান হচ্ছে দখলের প্রামাণ্য দলিল, মালিকানার দলিল নয়, খতিয়ানে মালিক ছাড়া অন্য কারো নাম অন্তরভুক্ত হয়ে গেলে যেমন সেই ব্যক্তির মালিকানা সৃস্টি হয় না তেমনি প্রকৃত মালিকের মালিকানা সত্বও নষ্ট হয় না শুধু মাত্র স্বত্বে কালিমা লিপ্ত হয়। জরিপের খসড়া প্রকাশের পর কোন ভুল ধরা পরলে, রেভিনিউ অফিসারের নিকট ৩০ ধারায় আবেদন করতে হবে। উক্ত রায়ের বিরুদ্ধে সেটেলমেন্ট অফিসারের নিকট ৩১ ধারায় আপিল করে খুব সহজেই ভুলগুলো সংশোধন করে নেওয়া যায়। কিন্তু এই সময়ের মধ্যে যদি খতিয়ানের ভুলগুলো সংশোধন করা না হয় এবং চূড়ান্ত খতিয়ান প্রকাশিত হয়ে যায়, তবে চুড়ান্ত রেকর্ড প্রকাশিত হয়ে গেলেও কিছু ক্ষেত্রে সহকারী কমিশনার (ভূমি) রেকর্ড সংশোধন করতে পারে। যেমন উক্ত ভুলগুলো যদি হয় শুধুমাত্র করণিক ভুল, প্রিন্টিং-এ ভুল সেক্ষেত্রে এ ধরণের সামান্য ভুল সহকারী কমিশনার (ভূমি)সংশোধন করতে পারে। তবে অন্যান্য ভূলের সংশোধনের ক্ষমতা একমাত্র কোর্টের। খতিয়ান সংশোধন করতে কি কি কাগজপত্র লাগবে: ১. উক্ত জমিতে মালিকানার সকল দলিলপত্র (যেমন মূল দলিলের সার্টিফাইড কপি, বায়া দলিল, পূর্বের খতিয়ানের কপি) ২. চূড়ান্তভাবে প্রকাশিত ভূল রেকর্ডের কপি ৩. আইডি কার্ডের ফটোকপি। এ সমস্ত কাগজপত্র নিয়ে একজন দক্ষ সিভিল আইনজীবী এর মাধ্যমে জমির খতিয়ানের ভুল সংশোধনের জন্য ভূমি জরিপ ট্রাইব্যুনালে/ চূড়ান্ত খতিয়ানের প্রকাশের ১ বছরের মধ্যে ল্যান্ড সার্ভে ট্রাইব্যুনাল সংশোধনীর মামলা করতে হবে তবে এ মেয়াদ আরও ১ বছর বর্ধিত হতে পারে। উক্ত সময়ের মধ্যে মামলা করতে না পারলে ভুল সম্পর্কে জানার ৬ বছরের মধ্যে দেওয়ানি আদালতে রেকর্ড ভুল ও অশুদ্ধ মর্মে ঘোষণা মূলক মোকদ্দমা করতে হবে। জমির খতিয়ানের ভুল এই মর্মে আদালত ডিক্রি/ রায় দিলে সেই ডিক্রির সার্টিফাইড কপি নিয়ে খতিয়ান সংশোধনের জন্য সহকারী কমিশনার (ভূমি)এর কাছে আবেদন করতে হবে। সহকারী কমিশনার (ভূমি)সবকিছু দেখে সন্তুষ্ট হলে পূর্বের ভুল রেকর্ডটি সংশোধন করে নতুন করে একটি রেকর্ড প্রকাশ করবে।",
    },
  
    {
      question: "খতিয়ানের করণিক ভুল সংশোধন করার নিয়ম ?",
      answer:
        "করণিক ভুলের মধ্যে নামের ভুল, অংশ বসানোর হিসেবে ভুল, দাগসুচিতে ভুল, ম্যাপের সংঙ্গে রেকর্ডের ভুল, জরিপকালে বাবার মৃত্যুর কারণে সন্তানদের নামে সম্পত্তি রেকর্ড হবার কথা থাকলেও জরিপকারকদের ভুল বা অজ্ঞাত কারণে তা মূল প্রজা বা বাবার নামে রেকর্ড হওয়া ইত্যাদি উল্লেখযোগ্য। খতিয়ানের করণীক ভুল সংশোধনের জন্য আপনাকে সংশ্লিষ্ট সহকারী কমিশনার (ভূমি) এর বরাবর আতবদন করতে হবে। সহকারী কমিশনার (ভূমি) আবেদন প্রাপ্তির পর সংশ্লিষ্ট রেজিস্টারে এন্ট্রি দিয়ে ইউনিয়ন ভূমি অফিসে প্রেরণ করা হয়। ইউনিয়ন ভূমি সহকারী কর্মকর্তা সরজমিন তদন্ত ও রেকর্ডপত্র যাচাই অন্তে প্রস্তাব/প্রতিবেদন উপজেলা ভূমি অফিসে প্রেরণ করেন। উক্ত প্রতিবেদন প্রাপ্তির পর বা আবেদন প্রাপ্তির পরই ইউনিয়ন ভূমি সহকারী কর্মকর্তার প্রতিবেদন দাখিলের সময়সীমা নির্ধারণ করার পাশাপাশি সহকারী কমিশনার (ভূমি) শুনানির তারিখ/দিন ধার্য করে আবেদনকারী/রেকর্ডীয় মালিক এবং স্বার্থসংশ্লিষ্টদের নোটিশ প্রদান করেন। ধার্য তারিখে শুনানি ও কাগজপত্র পরীক্ষা-নিরীক্ষা করে খতিয়ানের করণিক ভুল সংশোধনের আদেশ দেওয়া হয়। আদেশ অনুসারে ইউনিয়ন ভূমি সহকারী কর্মকর্তা কর্তৃক প্রস্তুতকৃত সংশোধিত ০৫ (পাঁচ) কপি খতিয়ানে স্বাক্ষর অন্তে প্রয়োজনীয় ফি আদায় সাপেক্ষে আবেদনকারীকে ১ (এক) কপি, মূল নথিতে ১ (এক), মূল খতিয়ান ভলিউমের সঙ্গে ১ (এক) কপি, জেলা রেকর্ড রুমে ১ (এক) কপি এবং ইউনিয়ন ভূমি অফিসের মূল ভলিউমে ১ (এক) কপি সংরক্ষণের জন্য প্রেরণ করা হয়। ইউনিয়ন ভূমি সহকারী কর্মকর্তা রেজিস্টার-২ হালনাগাদ করে প্রতিবেদন দাখিল করার মাধ্যমে খতিয়ানের করণিক ভুল সংশোধন প্রক্রিয়া সম্পন্ন হয়।",
    },
  
    {
      question: "দেওয়ানী মামলার শেষ করতে কতদিন লাগে ?",
      answer:
        "মামলার ধরণ, জটিলতা, এবং আদালতের কার্যপ্রণালীর উপর নির্ভর করে দেওয়ানী মামলার শেষ করতে কতদিন লাগবে তা নির্ধারণ করা কঠিন। সাধারণত, একটি দেওয়ানী মামলা শেষ করতে কয়েক বছর সময় লাগতে পারে।",
    },
  
    {
      question: "নামজারি করার খরচ কত ?",
      answer:
        "নামজারী করতে সর্বমোট ১১৭০ টাকা লাগে। আবেদনে কোর্ট ফী ২০ টাকা। নোটিশ জারি ফী ৫০ টাকা। খতিয়ান ফি ১০০ টাকা। রেকর্ড সংশোধন ফি ১০০০ টাকা "},
  
    {
      question: "নামজারি বাতিল করার নিয়ম কি ?",
      answer:
        "নামজারি বাতিলের জন্য আপনাকে নিম্নলিখিত পদক্ষেপগুলি অনুসরণ করতে হবে: আবেদনপত্র: সংশ্লিষ্ট উপজেলা সার্ভে অফিসে একটি আবেদনপত্র জমা দিতে হবে। কারণ উল্লেখ: আবেদনপত্রে নামজারি বাতিল করার কারণ স্পষ্টভাবে উল্লেখ করতে হবে। প্রয়োজনীয় কাগজপত্র: আবেদনপত্রের সাথে প্রয়োজনীয় কাগজপত্র (মূল দলিল, নামজারি সনদ, ইত্যাদি) জমা দিতে হবে। বিচার-বিবেচনা: উপজেলা সার্ভে অফিসার আপনার আবেদন বিবেচনা করে নামজারি বাতিলের সিদ্ধান্ত নেবেন।",
    },
  
    {
      question: "বন্টন মামলা কিভাবে করতে হয় ?",
      answer:
        "বন্টন মামলা করার জন্য আপনাকে নিম্নলিখিত পদক্ষেপগুলি অনুসরণ করতে হবে: আবেদনপত্র: সংশ্লিষ্ট পারিবারিক আদালতে একটি আবেদনপত্র জমা দিতে হবে। মামলার বিবরণ: আবেদনপত্রে সম্পত্তির বিবরণ, ভাগ্যের হিস্যা, এবং মামলার কারণ স্পষ্টভাবে উল্লেখ করতে হবে। প্রয়োজনীয় কাগজপত্র: আবেদনপত্রেআবেদনপত্রের সাথে প্রয়োজনীয় কাগজপত্র (মূল দলিল, ওয়ারিশ সনদ, ইত্যাদি) জমা দিতে হবে। মামলার বিচার: আদালত আপনার মামলার বিচার করে সম্পত্তির বন্টনের রায় দেবেন।",
    },
    {
      question: "ওয়ারিশ সম্পত্তি না পেলে করণীয় কি ?",
      answer:
        "ওয়ারিশ সম্পত্তি না পেলে আপনি নিম্নলিখিত পদক্ষেপগুলি গ্রহণ করতে পারেন: আলোচনা: প্রথমে ওয়ারিশদের সাথে আলোচনার মাধ্যমে সমস্যা সমাধানের চেষ্টা করুন। ওয়ারিশ সনদ: আপনার ওয়ারিশ হিসেবে স্বীকৃতির জন্য ওয়ারিশ সনদ তৈরি করুন। আইনি পদক্ষেপ: আলোচনায় সমাধান না হলে, পারিবারিক আদালতে মামলা দায়ের করুন।",
    },
  ];