export const pricingData = {
    liveTalk: [
      {
        id: 1,
        title: "তৎক্ষণিক উত্তর",
        price: "৳৫০০",
        features: ["ভিডিও কলে আইনি পরামর্শ"],
      },
      {
        id: 2,
        title: "বিস্তারিত বিশ্লেষণ",
        price: "৳১০০০",
        features: ["ভিডিও কলে আইনি পরামর্শ", "কাগজ দেখা ও পরামর্শ"],
      },
      {
        id: 3,
        title: "সম্পূর্ণ সমাধান",
        price: "৳২০০০",
        features: ["ভিডিও কলে আইনি পরামর্শ", "কাগজ দেখা ও পরামর্শ", "সরাসরি কাগজ দেখা"],
      },
    ],
   
  };
  